#! /usr/local/bin/regina
/* REXX */
PARSE VALUE '0 0' WITH PRYSUM SCORE2
DO WHILE LINES('INPUT.TXT') > 0                                             
   ITEMS = LINEIN('INPUT.TXT')
   ILEFT = LEFT(ITEMS,LENGTH(ITEMS)/2)
   IRIGHT = RIGHT(ITEMS,LENGTH(ITEMS)/2)
   CHR = SUBSTR(ILEFT,VERIFY(ILEFT, IRIGHT, 'M'),1)
   PRYSUM += PRIORITY(CHR)
END
SAY PRYSUM
EXIT 0

PRIORITY: PROCEDURE 
   PARSE ARG CHR
   CHARS = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'
RETURN POS(CHR, CHARS)